rocfatcat/M032FC1AE-CMAKE/app/test/user/MassStorage.c
/******************************************************************************//**
 * @file     MassStorage.c
 * @version  V1.00
 * @brief    M031 series USBD driver Sample file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2021 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/

/*!<Includes */
#include "M031Series_User.h"
#include "massstorage.h"
#include "rom.h"

#if 0
#define DBG_PRINTF      printf
#else
#define DBG_PRINTF(...)
#endif


#define EP0_MAX_PKT_SIZE    64

/*--------------------------------------------------------------------------*/
/* Global variables for Control Pipe */
uint32_t g_TotalSectors;
uint32_t g_u32u32StorageSize;
uint8_t volatile g_u8EP3Ready = 0;

/* USB flow control variables */
uint8_t g_u8BulkState;
uint8_t g_u8Size;
uint8_t g_au8SenseKey[4];
uint32_t g_u32DataFlashStartAddr;
uint32_t g_u32Address;
uint32_t g_u32Length;
uint32_t g_u32LbaAddress;
uint32_t g_u32BytesInStorageBuf;
uint32_t g_u32BulkBuf0, g_u32BulkBuf1;

/* CBW/CSW variables */
struct CBW g_sCBW;
struct CSW g_sCSW;

uint32_t MassBlock[MASS_BUFFER_SIZE / 4];
uint32_t Storage_Block[STORAGE_BUFFER_SIZE / 4];

/*--------------------------------------------------------------------------*/
IROM2_DATA_SECTION const uint8_t g_au8InquiryID[36] =
{
    0x00,                   /* Peripheral Device Type */
    0x80,                   /* RMB */
    0x00,                   /* ISO/ECMA, ANSI Version */
    0x00,                   /* Response Data Format */
    0x1F, 0x00, 0x00, 0x00, /* Additional Length */

    /* Vendor Identification */
    'N', 'u', 'v', 'o', 't', 'o', 'n', ' ',

    /* Product Identification */
    'U', 'S', 'B', ' ', 'M', 'a', 's', 's', ' ', 'S', 't', 'o', 'r', 'a', 'g', 'e',

    /* Product Revision */
    '1', '.', '0', '0'
};

/* code = 5Ah, Mode Sense */
static uint8_t g_au8ModePage_3F[64] =
{
    0x01, 0x0A, 0x00, 0x03, 0x00, 0x00, 0x00, 0x00,
    0x03, 0x00, 0x00, 0x00, 0x05, 0x1E, 0x13, 0x88,
    0x08, 0x20, 0x02, 0x00, 0x01, 0xF4, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x05,
    0x1E, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x01, 0x68, 0x00, 0x00, 0x1B, 0x0A, 0x00, 0x01,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x1C, 0x06, 0x00, 0x05, 0x00, 0x00, 0x00, 0x00
};


void USBD_IRQHandler(void)
{
    uint32_t u32IntSts = USBD_GET_INT_FLAG();
    uint32_t u32State = USBD_GET_BUS_STATE();

    if(u32IntSts & USBD_INTSTS_FLDET)
    {
        // Floating detect
        USBD_CLR_INT_FLAG(USBD_INTSTS_FLDET);

        if (USBD->VBUSDET)
        {
            /* USB Plug In */
            USBD_ENABLE_USB();
        }
        else
        {
            /* USB Un-plug */
            USBD_DISABLE_USB();
        }
    }

    if(u32IntSts & USBD_INTSTS_BUS)
    {
        /* Clear event flag */
        USBD_CLR_INT_FLAG(USBD_INTSTS_BUS);

        if(u32State & USBD_STATE_USBRST)
        {
            /* Bus reset */
            USBD_ENABLE_USB();
            USBD_SwReset();
            DBG_PRINTF("Bus reset\n");
        }
        if(u32State & USBD_STATE_SUSPEND)
        {
            /* Enable USB but disable PHY */
            USBD_DISABLE_PHY();
            DBG_PRINTF("Suspend\n");
        }
    }

    if(u32IntSts & USBD_INTSTS_USB)
    {
        // EP events
        if(u32IntSts & USBD_INTSTS_EP0)
        {
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_EP0);
            /* control IN */
            USBD_CtrlIn();
        }

        if(u32IntSts & USBD_INTSTS_EP1)
        {
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_EP1);

            /* control OUT */
        }

        if(u32IntSts & USBD_INTSTS_EP2)
        {
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_EP2);
            /* Bulk IN */
            MSC_AckCmd();
        }

        if(u32IntSts & USBD_INTSTS_EP3)
        {
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_EP3);
            /* Bulk OUT */
            g_u8EP3Ready = 1;
        }

        /* USB event */
        if(u32IntSts & USBD_INTSTS_SETUP)
        {
            /* Setup packet */
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_SETUP);

            /* Clear the data IN/OUT ready flag of control end-points */
            USBD_STOP_TRANSACTION(EP0);
            USBD_STOP_TRANSACTION(EP1);

            USBD_ProcessSetupPacket();
        }
    }

    /* clear unknown event */
    USBD_CLR_INT_FLAG(u32IntSts);
}


IROM2_SECTION void USBD_MSC_Stall(void)
{
    USBD_SET_EP_STALL(EP2);
    USBD_SET_EP_STALL(EP3);
}

IROM2_SECTION void MSC_Init(void)
{
    /* Init setup packet buffer */
    /* Buffer range for setup packet -> [0 ~ 0x7] */
    USBD->STBUFSEG = SETUP_BUF_BASE;

    /*****************************************************/
    /* EP0 ==> control IN endpoint, address 0 */
    USBD_CONFIG_EP(EP0, USBD_CFG_CSTALL | USBD_CFG_EPMODE_IN | 0);
    /* Buffer range for EP0 */
    USBD_SET_EP_BUF_ADDR(EP0, EP0_BUF_BASE);

    /* EP1 ==> control OUT endpoint, address 0 */
    USBD_CONFIG_EP(EP1, USBD_CFG_CSTALL | USBD_CFG_EPMODE_OUT | 0);
    /* Buffer range for EP1 */
    USBD_SET_EP_BUF_ADDR(EP1, EP1_BUF_BASE);

    /*****************************************************/
    /* EP2 ==> Bulk IN endpoint, address 2 */
    USBD_CONFIG_EP(EP2, USBD_CFG_EPMODE_IN | BULK_IN_EP_NUM);
    /* Buffer range for EP2 */
    USBD_SET_EP_BUF_ADDR(EP2, EP2_BUF_BASE);

    /* EP3 ==> Bulk Out endpoint, address 3 */
    USBD_CONFIG_EP(EP3, USBD_CFG_EPMODE_OUT | BULK_OUT_EP_NUM);
    /* Buffer range for EP3 */
    USBD_SET_EP_BUF_ADDR(EP3, EP3_BUF_BASE);

    /* trigger to receive OUT data */
    USBD_SET_PAYLOAD_LEN(EP3, EP3_MAX_PKT_SIZE);

    /*****************************************************/
    g_u32BulkBuf0 = EP3_BUF_BASE;
    g_u32BulkBuf1 = EP2_BUF_BASE;

    g_sCSW.dCSWSignature = CSW_SIGNATURE;
    g_u32u32StorageSize = FMC_Init();
    g_u32u32StorageSize += DATA_SEC_ADDR;
    g_TotalSectors = g_u32u32StorageSize / UDC_SECTOR_SIZE;
}

IROM2_SECTION void MSC_ClassRequest(void)
{
    uint8_t buf[8];
    uint8_t u8Temp;
    uint32_t u32Sum;

    USBD_GetSetupPacket(buf);

    u32Sum = buf[2] + buf[3] + buf[6] + buf[7];
    u8Temp = gsInfo.gu8ConfigDesc[LEN_CONFIG + 2];
    switch(buf[1])
    {
    case GET_MAX_LUN:
    {
        /* Check interface number with cfg descriptor and check wValue = 0, wLength = 1 */
        if((buf[4] == u8Temp) && (u32Sum == 1))
        {
            M8(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP0)) = 0;
            /* Data stage */
            USBD_SET_DATA1(EP0);
            USBD_SET_PAYLOAD_LEN(EP0, 1);

            /* Status stage */
            USBD_SET_PAYLOAD_LEN(EP1, EP0_MAX_PKT_SIZE);
        }
        else
            USBD_SET_EP_STALL(EP1); /* Stall when wrong parameter */

        break;
    }
    case BULK_ONLY_MASS_STORAGE_RESET:
    {
        /* Check interface number with cfg descriptor and check wValue = 0, wLength = 0 */
        if ((buf[4] == u8Temp) && (u32Sum == 0))
        {
            g_u32Length = 0; /* Reset all read/write data transfer */

            /* Clear ready */
            USBD->EP[EP2].CFGP |= USBD_CFGP_CLRRDY_Msk;
            USBD->EP[EP3].CFGP |= USBD_CFGP_CLRRDY_Msk;

            /* Prepare to receive the CBW */
            g_u8EP3Ready = 0;
            g_u8BulkState = BULK_CBW;

            USBD_SET_DATA1(EP3);
            USBD_SET_EP_BUF_ADDR(EP3, g_u32BulkBuf0);
            USBD_SET_PAYLOAD_LEN(EP3, 31);
        }
        else
        {
            /* Stall when wrong parameter */
            USBD_SET_EP_STALL(EP1);
        }

        /* Status stage */
        USBD_SET_DATA1(EP0);
        USBD_SET_PAYLOAD_LEN(EP0, 0);

        break;
    }
    }
}

