rocfatcat/M032FC1AE-CMAKE/app/test/user/MassStorage.c
IROM2_DATA_SECTION const uint8_t msg[] = {'D','-','R','C','P','\r','\n'};
IROM2_DATA_SECTION const uint8_t msg3[] = {'D','-','R','C','P','E','\r','\n'};
IROM2_DATA_SECTION const uint8_t msg4[] = {'D','-','O','P','C','D','\r','\n'};

IROM2_SECTION void MSC_ReadCapacity1(uint32_t u32Offset, uint8_t u8OPCode)
{
    UART_Write(UART0, (uint8_t*)msg, 7);
    uint32_t tmp = g_TotalSectors;
    uint8_t *pu8Desc;

    pu8Desc = (uint8_t *)MassCMD_BUF;

    USBD_MemReset(pu8Desc, 36);
    UART_Write(UART0, (uint8_t*)msg4, 8);
    UART_WriteHex(UART0, u8OPCode, 8);
    UART_WriteHex(UART0, u32Offset, 8);
    UART_WriteHex(UART0, tmp, 8);

    if (u8OPCode)
    {
        tmp--;

        pu8Desc[u32Offset + 2] = (uint8_t)(tmp >> 8);
        pu8Desc[u32Offset + 3] = tmp & 0xFF;

        pu8Desc[u32Offset + 6] = 0x02;
    }
    else
    {
        /*---------- Capacity List Header ----------*/
        /* Capacity List Length */
        pu8Desc[3] = 0x10;

        /*---------- Current/Maximum Capacity Descriptor ----------*/
        /* Number of blocks (MSB first) */
        pu8Desc[6] = (uint8_t)(tmp >> 8);
        pu8Desc[7] = tmp & 0xFF;

        /* Descriptor Code:                                                             */
        /* 01b = Unformatted Media - Maximum formattable capacity for this cartridge    */
        /* 10b = Formatted Media - Current media capacity                               */
        /* 11b = No Cartridge in Drive - Maximum formattable capacity for any cartridge */
        pu8Desc[8] = 0x02;

        // Block Length. Fixed to be 512 (MSB first)
        pu8Desc[10] = 0x02;

        /*---------- Formattable Capacity Descriptor ----------*/
        /* Number of Blocks */
        pu8Desc[14] = (uint8_t)(tmp >> 8);
        pu8Desc[15] = tmp & 0xFF;

        /* Block Length. Fixed to be 512 (MSB first) */
        pu8Desc[18] = 0x02;
    }
    UART_Write(UART0, (uint8_t*)msg3, 8);

}

IROM2_DATA_SECTION const uint8_t msgMSCRead[] = {'M','S','C',' ','R','e','a','d','\r','\n'};
IROM2_SECTION void MSC_Read(uint8_t u8IsTrig)
{
    UART_Write(UART0, (uint8_t*)msgMSCRead, 10);
    UART_WriteHex(UART0, u8IsTrig, 8);
    UART_WriteHex(UART0, g_u32Length, 8);
    UART_WriteHex(UART0, g_u32BytesInStorageBuf, 8);
    UART_WriteHex(UART0, g_u32Address, 8);
    UART_WriteHex(UART0, g_u32LbaAddress, 8);

    // printf("MSC_Read u8IsTrig = %d\n", u8IsTrig);
    // printf("g_u32Length = %d\n", g_u32Length);
    // printf("g_u32BytesInStorageBuf = %d\n", g_u32BytesInStorageBuf);
    // printf("g_u32Address = %x\n", g_u32Address);
    // printf("g_u32LbaAddress = %x\n", g_u32LbaAddress);
    uint32_t u32Len;
    uint32_t u32Buf;

    if(USBD_GET_EP_BUF_ADDR(EP2) == g_u32BulkBuf1)
        u32Buf = g_u32BulkBuf0;
    else
        u32Buf = g_u32BulkBuf1;

    if (!u8IsTrig)
    {
        USBD_SET_EP_BUF_ADDR(EP2, u32Buf);

        /* Trigger to send out the data packet */
        USBD_SET_PAYLOAD_LEN(EP2, g_u8Size);

        g_u32Length -= g_u8Size;
        g_u32BytesInStorageBuf -= g_u8Size;
    }

    if (g_u32Length)
    {
        if (!g_u32BytesInStorageBuf)
        {
            u32Len = g_u32Length;
            if (u32Len > STORAGE_BUFFER_SIZE)
                u32Len = STORAGE_BUFFER_SIZE;

            DataFlashRead(g_u32LbaAddress, Storage_Block);

            g_u32BytesInStorageBuf = u32Len;
            g_u32LbaAddress += u32Len;
            g_u32Address = STORAGE_DATA_BUF;
        }

        /* Prepare next data packet */
        g_u8Size = EP2_MAX_PKT_SIZE;
        if (g_u8Size > g_u32Length)
            g_u8Size = g_u32Length;

        USBD_MemCopy((uint8_t *)((uint32_t)USBD_BUF_BASE + u32Buf), (uint8_t *)g_u32Address, g_u8Size);
        g_u32Address += g_u8Size;

        if (u8IsTrig)
        {
            /* DATA0/DATA1 Toggle */
            USBD_SET_EP_BUF_ADDR(EP2, u32Buf);

            /* Trigger to send out the data packet */
            USBD_SET_PAYLOAD_LEN(EP2, g_u8Size);

            g_u32Length -= g_u8Size;
            g_u32BytesInStorageBuf -= g_u8Size;
        }
    }
    else if (u8IsTrig)
        USBD_SET_PAYLOAD_LEN(EP2, 0);
}

IROM2_DATA_SECTION const uint8_t modeSense10[] = {'M','o','d','e',' ','S','e','n','s','e','1','0','\r','\n'};

IROM2_SECTION void MSC_ModeSense10(void)
{
    uint8_t NumHead, NumSector;
    uint16_t NumCyl = 0;
    UART_Write(UART0, (uint8_t*)modeSense10, 14);
    /* Clear the command buffer */
    *((uint32_t *)MassCMD_BUF) = 0;
    *((uint32_t *)MassCMD_BUF + 1) = 0;
    UART_WriteHex(UART0, g_sCBW.au8Data[0], 8);
    switch(g_sCBW.au8Data[0])
    {
    case 0x3F:
        *((uint8_t *)MassCMD_BUF) = 0x47;

        USBD_MemCopy((uint8_t *)MassCMD_BUF + 8, g_au8ModePage_3F, sizeof(g_au8ModePage_3F));

        NumHead = 2;
        NumSector = 64;
        NumCyl = g_TotalSectors / 128;

        *((uint8_t *)(MassCMD_BUF + 24)) = NumHead;
        *((uint8_t *)(MassCMD_BUF + 25)) = NumSector;
        *((uint8_t *)(MassCMD_BUF + 28)) = (uint8_t)(NumCyl >> 8);
        *((uint8_t *)(MassCMD_BUF + 29)) = (uint8_t)(NumCyl & 0x00FF);
        break;

    default:
        g_au8SenseKey[0] = 0x05;
        g_au8SenseKey[1] = 0x24;
        g_au8SenseKey[2] = 0x00;
    }
}

IROM2_SECTION void MSC_Write(void)
{
    uint32_t lba, len;
    uint32_t u32Bufa, u32Bufb;

    if(USBD_GET_EP_BUF_ADDR(EP3) == g_u32BulkBuf0)
    {
        u32Bufa = g_u32BulkBuf1;
        u32Bufb = g_u32BulkBuf0;
    }
    else
    {
        u32Bufa = g_u32BulkBuf0;
        u32Bufb = g_u32BulkBuf1;
    }

    if (g_u32Length > EP3_MAX_PKT_SIZE)
    {
        USBD_SET_EP_BUF_ADDR(EP3, u32Bufa);
        USBD_SET_PAYLOAD_LEN(EP3, EP3_MAX_PKT_SIZE);
        USBD_MemCopy((uint8_t *)g_u32Address, (uint8_t *)((uint32_t)USBD_BUF_BASE + u32Bufb), EP3_MAX_PKT_SIZE);

        g_u32Address += EP3_MAX_PKT_SIZE;
        g_u32Length -= EP3_MAX_PKT_SIZE;

        /* Buffer full. Writer it to storage first. */
        if (g_u32Address >= (STORAGE_DATA_BUF + STORAGE_BUFFER_SIZE))
        {
            DataFlashWrite(g_u32DataFlashStartAddr, Storage_Block);
            g_u32Address = STORAGE_DATA_BUF;
            g_u32DataFlashStartAddr += STORAGE_BUFFER_SIZE;
        }
    }
    else
    {
        USBD_MemCopy((uint8_t *)g_u32Address, (uint8_t *)((uint32_t)USBD_BUF_BASE + u32Bufb), g_u32Length);

        g_u32Address += g_u32Length;
        g_u32Length = 0;

        lba = get_be32(&g_sCBW.au8Data[0]);

