rocfatcat/M032FC1AE-CMAKE/app/test/user/MassStorage.c
        len = lba * UDC_SECTOR_SIZE + g_sCBW.dCBWDataTransferLength - g_u32DataFlashStartAddr;

        if (len)
        {
            DataFlashWrite(g_u32DataFlashStartAddr, Storage_Block);
        }

        g_u8BulkState = BULK_IN;
        MSC_AckCmd();
    }
}
IROM2_DATA_SECTION const uint8_t msgOPCode[] = {'D','-','M','S','D',' ','P','R','O','C','S','S','\r','\n'};
IROM2_SECTION void MSC_ProcessCmd(void)
{
    uint32_t u32Buf;
    int32_t i;

    if (!g_u8EP3Ready)
        return;

    g_u8EP3Ready = 0;

    if (g_u8BulkState == BULK_CBW)
    {
        /* Check Signature & length of CBW */
        /* Bulk Out buffer */
        u32Buf = USBD_BUF_BASE + g_u32BulkBuf0;

        if ((*(uint32_t *)u32Buf) != CBW_SIGNATURE)
        {
            USBD_MSC_Stall();

            g_u8BulkState = BULK_CBW;
            DBG_PRINTF("CBW signature fail. stall bulk out pipe\n");
            return;
        }

        /* Get the CBW */
        USBD_MemCopy((uint8_t *)&g_sCBW.dCBWSignature, (uint8_t *)u32Buf, 31);

        /* Prepare to echo the tag from CBW to CSW */
        g_sCSW.dCSWTag = g_sCBW.dCBWTag;
        UART_Write(UART0, (uint8_t*)msgOPCode, 14);
        UART_WriteHex(UART0, g_sCBW.u8OPCode,8);
        /* Parse Op-Code of CBW */
        switch(g_sCBW.u8OPCode)
        {
        case UFI_VERIFY_10:
        case UFI_TEST_UNIT_READY:
        {
            DBG_PRINTF("Test Unit\n");
            g_u8BulkState = BULK_IN;
            MSC_AckCmd();
            return;
        }
        case UFI_READ_FORMAT_CAPACITY:
        case UFI_READ_CAPACITY:
        case UFI_READ_CAPACITY_16:
        case UFI_MODE_SENSE_10:
        {
            uint32_t u32Offset = 0;
            uint32_t u32Limit = 36;

            g_u32Address = MassCMD_BUF;

            if (g_sCBW.u8OPCode == UFI_MODE_SENSE_10)
            {
                if (g_u32Length == 0)
                    g_u32Length = g_sCBW.dCBWDataTransferLength;

                MSC_ModeSense10();
            }
            else
            {
                if (g_sCBW.u8OPCode == UFI_READ_FORMAT_CAPACITY)
                    u32Limit = 20;

                g_u32Length = g_sCBW.dCBWDataTransferLength;
                if (g_u32Length > u32Limit)
                    g_u32Length = u32Limit;

                if (g_sCBW.u8OPCode == UFI_READ_CAPACITY_16)
                    u32Offset = 4;

                MSC_ReadCapacity1(u32Offset, g_sCBW.u8OPCode & 0x04);
            }

            g_u8BulkState = BULK_IN;

            if (g_u32Length > 0)
            {
                if(g_u32Length > EP2_MAX_PKT_SIZE)
                    g_u8Size = EP2_MAX_PKT_SIZE;
                else
                    g_u8Size = g_u32Length;

                /* Bulk IN buffer */
                USBD_MemCopy((uint8_t *)((uint32_t)USBD_BUF_BASE + g_u32BulkBuf1), (uint8_t *)g_u32Address, g_u8Size);
                g_u32BytesInStorageBuf = g_u8Size;

                g_u32Address += g_u8Size;
                USBD_SET_EP_BUF_ADDR(EP2, g_u32BulkBuf0);

                MSC_Read(0);
            }
            return;
        }

        case UFI_INQUIRY:
        {
            uint8_t u8PageCode;

            u8PageCode = g_sCBW.au8Data[0];

            g_u8BulkState = BULK_IN;

            /* u8PageCode should be zero */
            if(u8PageCode)
            {
                /* Expecting a STALL after data phase completes with a zero-length or short packet */
                USBD_SET_EP_STALL(EP3);

                DBG_PRINTF("INQUIRY page code = %d", u8PageCode);
            }
            /* Bulk IN buffer */
            USBD_MemCopy((uint8_t *)((uint32_t)USBD_BUF_BASE + g_u32BulkBuf1), (uint8_t *)g_au8InquiryID, sizeof(g_au8InquiryID));
            USBD_SET_PAYLOAD_LEN(EP2, 36);

            return;
        }
        case UFI_READ_10:
        case UFI_READ_12:
        {
            /* Check if it is a new transfer */
            if (g_u32Length == 0)
            {
                /* Prepare the data for Bulk IN transfer */
                /* Get LBA address */
                g_u32Address = get_be32(&g_sCBW.au8Data[0]);
                g_u32LbaAddress = g_u32Address * UDC_SECTOR_SIZE;
                g_u32Length = g_sCBW.dCBWDataTransferLength;
                g_u32BytesInStorageBuf = g_u32Length;

                DBG_PRINTF("Read addr=0x%x, len=0x%x\n", g_u32LbaAddress, g_u32Length);

                /* Error check  */
                if ((g_u32LbaAddress > g_u32u32StorageSize) || ((g_u32LbaAddress + g_u32Length) > g_u32u32StorageSize))
                {
                    USBD_MSC_Stall();

                    DBG_PRINTF("Stall ep2, ep3. addr=0x%x, len=0x%x\n", g_u32LbaAddress, g_u32Length);
                    return;
                }

                i = g_u32Length;
                if (i > STORAGE_BUFFER_SIZE)
                    i = STORAGE_BUFFER_SIZE;

                DataFlashRead(g_u32Address * UDC_SECTOR_SIZE, Storage_Block);

                g_u32BytesInStorageBuf = i;
                g_u32LbaAddress += i;
            }
            g_u32Address = STORAGE_DATA_BUF;

            /* Indicate the next packet should be Bulk IN Data packet */
            g_u8BulkState = BULK_IN;

            if (g_u32BytesInStorageBuf > 0)
            {
                /* Set the packet size */
                if(g_u32BytesInStorageBuf > EP2_MAX_PKT_SIZE)
                    g_u8Size = EP2_MAX_PKT_SIZE;
                else
                    g_u8Size = g_u32BytesInStorageBuf;

                /* Prepare the first data packet (DATA1) */
                /* Bulk IN buffer */
                USBD_MemCopy((uint8_t *)((uint32_t)USBD_BUF_BASE + g_u32BulkBuf1), (uint8_t *)g_u32Address, g_u8Size);
                g_u32Address += g_u8Size;

                /* kick - start */
                USBD_SET_EP_BUF_ADDR(EP2, g_u32BulkBuf1);
                /* Trigger to send out the data packet */
                USBD_SET_PAYLOAD_LEN(EP2, g_u8Size);
                g_u32Length -= g_u8Size;
                g_u32BytesInStorageBuf -= g_u8Size;
            }

            return;
        }
        case UFI_WRITE_10:
        case UFI_WRITE_12:
        {
            if (g_u32Length == 0)
            {
                g_u32Length = g_sCBW.dCBWDataTransferLength;
                g_u32Address = STORAGE_DATA_BUF;
                g_u32DataFlashStartAddr = get_be32(&g_sCBW.au8Data[0]) * UDC_SECTOR_SIZE;
            }
            DBG_PRINTF("Write 0x%x  0x%x\n", g_u32Address, g_u32Length);

            if (g_u32Length > 0)
            {
                USBD_SET_PAYLOAD_LEN(EP3, EP3_MAX_PKT_SIZE);
                g_u8BulkState = BULK_OUT;
            }
            return;
        }
        case UFI_MODE_SENSE_6:
        {
            uint32_t u32Data = 0x3;
            g_u8BulkState = BULK_IN;
            USBD_MemCopy((uint8_t *)((uint32_t)USBD_BUF_BASE + g_u32BulkBuf1), (uint8_t *)u32Data, 4);

            USBD_SET_PAYLOAD_LEN(EP2, 4);
            return;
        }
        }
    }
    else if (g_u8BulkState == BULK_OUT)
    {
        switch(g_sCBW.u8OPCode)
        {
        case UFI_WRITE_10:
        case UFI_WRITE_12:
        {
            MSC_Write();
            return;
        }
        }
    }
}

