rocfatcat/M032FC1AE-CMAKE/app/test/user/MassStorage.c
IROM2_DATA_SECTION const uint8_t msgAck[] = {'D','-','M','S','C','A','C','K','\r','\n'};
IROM2_DATA_SECTION const uint8_t msgAck2[] = {'D','-','M','S','C','A','C','K','-','E','N','\r','\n'};
IROM2_SECTION void MSC_AckCmd(void)
{
    /* Bulk IN */
    if(g_u8BulkState == BULK_CSW)
    {
        /* Prepare to receive the CBW */
        g_u8BulkState = BULK_CBW;

        USBD_SET_EP_BUF_ADDR(EP3, g_u32BulkBuf0);
        USBD_SET_PAYLOAD_LEN(EP3, 31);

        DBG_PRINTF("CSW ack\n");
    }
    else if(g_u8BulkState == BULK_IN)
    {
        uint32_t u32len = g_sCBW.dCBWDataTransferLength;

        g_sCSW.dCSWDataResidue = 0;
        g_sCSW.bCSWStatus = 0;
        UART_Write(UART0, (uint8_t*)msgAck, 10);
        UART_WriteHex(UART0, g_sCBW.u8OPCode, 8);
        switch(g_sCBW.u8OPCode)
        {
        case UFI_READ_FORMAT_CAPACITY:
        case UFI_READ_CAPACITY:
        case UFI_READ_CAPACITY_16:
        case UFI_MODE_SENSE_10:
        case UFI_INQUIRY:
        {
            if((g_u32Length > 0) && (g_sCBW.u8OPCode != UFI_INQUIRY))
            {
                MSC_Read(0);
                return;
            }

            if (u32len > 36)
                g_sCSW.dCSWDataResidue = u32len - 36;

            break;
        }
        case UFI_READ_10:
        case UFI_READ_12:
        {
            if(g_u32Length > 0)
            {
                MSC_Read(1);
                return;
            }
        }
        case UFI_VERIFY_10:
        case UFI_WRITE_10:
        case UFI_WRITE_12:
        {
            int32_t tmp;

            tmp = u32len - STORAGE_BUFFER_SIZE;
            if (tmp < 0)
                tmp = 0;

            g_sCSW.dCSWDataResidue = tmp;
            break;
        }
        case UFI_TEST_UNIT_READY:
        {
            break;
        }
        case UFI_MODE_SENSE_6:
        {
            g_sCSW.dCSWDataResidue = u32len - 4;
            break;
        }
        default:
        {
            /* Unknown command */
            g_sCSW.dCSWDataResidue = u32len;
            g_sCSW.bCSWStatus = 1;   /* return command failed */

            break;
        }
        }
        UART_Write(UART0, (uint8_t*)msgAck2, 13);
        UART_WriteHex(UART0, g_sCSW.dCSWDataResidue, 8);
        UART_WriteHex(UART0, g_sCSW.bCSWStatus, 8);
        UART_WriteHex(UART0, g_u32BulkBuf1, 8);
        /* Return the CSW */
        USBD_SET_EP_BUF_ADDR(EP2, g_u32BulkBuf1);

        /* Bulk IN buffer */
        USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + g_u32BulkBuf1), (uint8_t *)&g_sCSW.dCSWSignature, 16);

        g_u8BulkState = BULK_CSW;
        USBD_SET_PAYLOAD_LEN(EP2, 13);

        DBG_PRINTF("Prepare CSW\n");
    }
    else
    {
        /* This should be a DATA phase error */
        USBD_MSC_Stall();

        DBG_PRINTF("Unexpected IN ack\n");
    }
}


IROM2_SECTION void MSC_SetConfig(void)
{
    /* Clear stall status and ready */
    USBD->EP[2].CFGP = 1;
    USBD->EP[3].CFGP = 1;

    /*****************************************************/
    /* EP2 ==> Bulk IN endpoint, address 2 */
    USBD_CONFIG_EP(EP2, USBD_CFG_EPMODE_IN | BULK_IN_EP_NUM);
    /* Buffer range for EP2 */
    USBD_SET_EP_BUF_ADDR(EP2, EP2_BUF_BASE);

    /* EP3 ==> Bulk Out endpoint, address 3 */
    USBD_CONFIG_EP(EP3, USBD_CFG_EPMODE_OUT | BULK_OUT_EP_NUM);
    /* Buffer range for EP3 */
    USBD_SET_EP_BUF_ADDR(EP3, EP3_BUF_BASE);

    /* trigger to receive OUT data */
    USBD_SET_PAYLOAD_LEN(EP3, EP3_MAX_PKT_SIZE);

    g_u8BulkState = BULK_CBW;

    DBG_PRINTF("Set config\n");
}

